/**
*
* ━━━━━━神兽出没━━━━━━
* 　　 ┏┓　    ┏┓
* 　　┏┛┻━━━━━━┛┻┓
* 　　┃　　　　  ┃
* 　　┃　　 ━　  ┃
* 　　┃　┳┛　┗┳　┃
* 　　┃　　　　　┃
* 　　┃　　 ┻　  ┃
* 　　┃　　　　　┃
* 　　┗━┓　　　┏━┛Code is far away from bug with the animal protecting
* 　　　┃　　　┃ 神兽保佑,代码无bug
* 　　　┃　　　┃
* 　　　┃　　　┗━━━┓
* 　　　┃　　　　　┣┓
* 　　　┃　　　　　┏┛
* 　　　┗┓┓┏━┳┓┏┛
* 　　　 ┃┫┫ ┃┫┫
* 　　　 ┗┻┛ ┗┻┛
*
*/    
/**
* 　　　　　　　 ┏┓　　　┏┓
* 　　　　　　　┏┛┻━━━━━━┛┻┓
* 　　　　　　　┃　　　　　┃ 　
* 　　　　　　　┃　　 ━　  ┃
* 　　　　　　　┃　＞　　＜┃
* 　　　　　　　┃　　　　　┃
* 　　　　　　　┃...　⌒ ...┃
* 　　　　　　　┃　　　　　┃
* 　　　　　　　┗━┓　　　┏━┛
* 　　　　　　　　┃　　　┃　Code is far away from bug with the animal protecting　　　　　　　　　　
* 　　　　　　　　┃　　　┃ 神兽保佑,代码无bug
* 　　　　　　　　┃　　　┃　　　　　　　　　　　
* 　　　　　　　　┃　　　┃ 　　　　　　
* 　　　　　　　　┃　　　┃
* 　　　　　　　　┃　　　┃　　　　　　　　　　　
* 　　　　　　　　┃　　　┗━━━┓
* 　　　　　　　　┃　　　　　┣┓
* 　　　　　　　　┃　　　　　┏┛
* 　　　　　　　　┗┓┓┏━┳┓┏┛
* 　　　　　　　 　┃┫┫ ┃┫┫
* 　　　　　　 　　┗┻┛ ┗┻┛
*/

/**
*　　　　　　　 ┏┓　 ┏┓+ +
*　　　　　　　┏┛┻━━━┛┻━━┓ + +
*　　　　　　　┃　　     ┃ 　
*　　　　　　　┃　━　    ┃ ++ + + +
*　　　　　　 ████━████ ┃+
*　　　　　　　┃　　　　 ┃ +
*　　　　　　　┃　┻　　　┃
*　　　　　　　┃　　　　 ┃ + +
*　　　　　　　┗━┓　　 ┏━┛
*　　　　　　　　┃　　 ┃　　　　　　　　　　　
*　　　　　　　　┃　　 ┃ + + + +
*　　　　　　　　┃　　 ┃　　　　Code is far away from bug with the animal protecting　　　　　　　
*　　　　　　　　┃　　 ┃ + 　　　　神兽保佑,代码无bug　　
*　　　　　　　　┃　　 ┃
*　　　　　　　　┃　　 ┃　　+　　　　　　　　　
*　　　　　　　　┃　 　┗━━━┓ + +
*　　　　　　　　┃ 　　　　┣┓
*　　　　　　　　┃ 　　　　┏┛
*　　　　　　　　┗┓┓┏━┳┓┏┛ + + + +
*　　　 　　　　　┃┫┫ ┃┫┫
*　　 　　　　　　┗┻┛ ┗┻┛+ + + +
*/

//哈哈，我也真是够了，无聊的竟然弄这种东西～～
//不过我喜欢！！
